app/views/notes/_note.html.erb

    <small>
      <%= note.likes.count  %> liked
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."note_id" = ?  [["note_id", 24]]