app/views/notes/show.html.erb

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."note_id" = ? LIMIT 1  [["user_id", 9], ["note_id", 22]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."note_id" = ?  [["note_id", 22]]
---
  <small>
    <%= link_to @note.likes.count, liking_users_note_path(@note.id), id: 'like-count' %> liked