app/views/likes/_like_links.html.erb

<% if current_user.likes.find_by(note_id: @note.id) %>
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."note_id" = ? LIMIT 1  [["user_id", 9], ["note_id", 23]]