app/views/likes/unlike.js.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."note_id" = ?  [["note_id", 23]]
---
$('#like-link').html('<%=escape_javascript(render("likes/like_links", note: @note)) %>');
$('#like-count').html('<%= @note.likes.count %>');