app/views/users/show.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 9]]
---
</ul>
<%= link_to @user.likes.count, like_notes_user_path(@user.id) %> liked.
