app/controllers/home_controller.rb

  def top
    if user_signed_in?
      @note = Note.new
      @notes = Note.all.order(created_at: :desc)
---
SELECT "notes".* FROM "notes"  ORDER BY "notes"."created_at" DESC