app/controllers/likes_controller.rb

  def like
    @note = Note.find(params[:note_id])
    like = current_user.likes.build(note_id: @note.id)
    like.save
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", 24]]
INSERT INTO "likes" ("note_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["note_id", 24], ["user_id", 9], ["created_at", "2017-03-17 11:53:13.123773"], ["updated_at", "2017-03-17 11:53:13.123773"]]

  def unlike
    @note = Note.find(params[:note_id])
    like = current_user.likes.find_by(note_id: @note.id)
    like.destroy
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", 22]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."note_id" = ? LIMIT 1  [["user_id", 9], ["note_id", 22]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 9]]